app/controllers/home_controller.rb

SELECT "transactions".* FROM "transactions" ORDER BY "transactions"."data" DESC
---
  def index
    transactions = Transaction.order(data: :desc)
    @lojas = transactions.group_by(&:loja)